Pandas是基于Numpy创建的Python库，为Python提供了易于使用的数据结构和数据分析工具。

使用以下语句导入Pandas库：

In [1]:
import pandas as pd

## Pandas数据结构

### Series - 序列

存储任意类型数据的一维数组

In [2]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

In [ ]:
s

### DataFrame - 数据帧

In [4]:
data = {'Country': ['Belgium', 'India', 'Brazil'],
        'Capital': ['Brussels', 'New Delhi', 'Brasília'],
        'Population': [11190846, 1303171035, 207847528]}

In [5]:
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])

In [6]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

### 调用帮助

In [7]:
help(pd.Series.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - An alignable boolean Series. The index of the key will be aligned before
      masking.
    - An alignable Index. The Index of the returned selection will be the input.
    - A ``callable`` function with one argument (the calling Series or
      DataFrame) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`.

    Raises
    ------
    KeyError
        If any items are not found.
    IndexingError
        If an indexed key is passed and its index is unalignable to the frame index.

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair.
    DataFrame.iloc : Access group of rows and columns by integer position(s).
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
        Series/DataFrame.
    Series.loc : Access group of values using labels.

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=['cobra', 'viper', 'sidewinder'],
    ...      columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Alignable boolean Series:

    >>> df.loc[pd.Series([False, True, False],
    ...        index=['viper', 'sidewinder', 'cobra'])]
                max_speed  shield
    sidewinder          7       8

    Index (same behavior as ``df.reindex``)

    >>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
           max_speed  shield
    foo
    cobra          1       2
    viper          4       5

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...    ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...         [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

## 输入/输出

### 读取/写入CSV

In [10]:
df.to_csv('myDataFrame.csv', index=False)

In [11]:
pd.read_csv('myDataFrame.csv', nrows=5)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

### 读取/写入Excel

In [15]:
df.to_excel('myDataFrame.xlsx', index=False, sheet_name='Sheet1')

In [16]:
pd.read_excel('myDataFrame.xlsx')

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [18]:
xlsx = pd.ExcelFile('myDataFrame.xlsx')   #读取内含多个表的Excel

In [19]:
df = pd.read_excel(xlsx, 'Sheet1')   #读取多表Excel中的Sheet1表

In [20]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

### 读取和写入 SQL 查询及数据库表

In [ ]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine('sqlite:///:memory:')

In [ ]:
pd.read_sql("SELECT * FROM my_table;", engine)

In [ ]:
pd.read_sql_table('my_table', engine)

In [ ]:
pd.read_sql_query("SELECT * FROM my_table;", engine)

**read_sql()是 read_sql_table() 与 read_sql_query()的便捷打包器**

In [ ]:
pd.to_sql('myDf', engine)

## 筛选数据

### 取值

In [21]:
s['b']   #取序列的值

-5

In [22]:
df[1:]   #取数据帧的子集

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

### 选取、布尔索引及设置值

**按位置**

In [23]:
df.iloc[[0], [0]]   #按行与列的位置选择某值

   Country
0  Belgium

In [27]:
df.iat[0, 0]

'Belgium'

**按标签**

In [28]:
df.loc[[0], ['Country']]   #按行与列的名称选择某值

   Country
0  Belgium

In [31]:
df.at[0, 'Country']   #按行与列的名称选择某值

'Belgium'

**按标签/位置**

In [35]:
df.loc[2]   #选择某行

Country          Brazil
Capital        Brasília
Population    207847528
Name: 2, dtype: object

In [37]:
df.loc[:, 'Capital']   #选择某列

0     Brussels
1    New Delhi
2     Brasília
Name: Capital, dtype: object

In [38]:
df.loc[1, 'Capital'] #按行列取值

'New Delhi'

**布尔索引**

In [39]:
s[~(s > 1)]   #序列S中没有大于1的值

b   -5
dtype: int64

In [40]:
s[(s < -1) | (s > 2)]   #序列S中小于-1或大于2的值

a    3
b   -5
c    7
d    4
dtype: int64

In [41]:
df[df['Population']>1200000000]   #选择数据帧中Population大于12亿的数据

  Country    Capital  Population
1   India  New Delhi  1303171035

In [42]:
df.loc[df['Population']>1200000000, ['Country', 'Capital']]   #选择数据帧中人口大于12亿的数据'Country'和'Capital'字段

  Country    Capital
1   India  New Delhi

**设置值**

In [43]:
s['a'] = 6   #将序列s中索引为a的值设为6

## 删除数据

**通过drop函数删除数据**

In [44]:
s.drop(['a', 'c'])   #按索引删除序列的值(axis=0)

b   -5
d    4
dtype: int64

In [45]:
df.drop('Country', axis=1)   #按列名删除数据帧的列(axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

## 排序和排名

**根据索引或者值进行排序**

In [46]:
df.sort_index()   #按索引排序

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [47]:
df.sort_values(by='Country')   #按某列的值排序

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [48]:
df.rank()   #数据帧排名

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

## 查询信息与计算

### 基本信息

In [49]:
df.shape   #(行,列)

(3, 3)

In [50]:
df.index   #获取索引

RangeIndex(start=0, stop=3, step=1)

In [51]:
df.columns   #获取列名

Index(['Country', 'Capital', 'Population'], dtype='object')

In [52]:
df.info()   #获取数据帧基本信息

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [53]:
df.count()   #非Na值的数量

Country       3
Capital       3
Population    3
dtype: int64

### 汇总

In [54]:
df.sum()   #合计

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [55]:
df.cumsum()   #累计

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314361881
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasília  1522209409

In [59]:
df['Population'].min()/df['Population'].max()   #最小值除以最大值

0.008587396204673933

In [60]:
df['Population'].idxmin()/df['Population'].idxmax()   #索引最小值除以索引最大值

0.0

In [61]:
df.describe()   #基础统计数据

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [62]:
df.mean()   #平均值

Population    5.074031e+08
dtype: float64

In [63]:
df.median()   #中位数

Population    207847528.0
dtype: float64

## 应用函数

**通过apply函数应用变换**

In [64]:
f = lambda x: x*2   #应用匿名函数lambda

In [65]:
df.apply(f)   # 应用函数

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606342070
2    BrazilBrazil    BrasíliaBrasília   415695056

In [66]:
df.applymap(f)   #对每个单元格应用函数

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606342070
2    BrazilBrazil    BrasíliaBrasília   415695056

## 数据对齐

### 内部数据对齐

**如有不一致的索引，则使用NA值：**

In [67]:
s3 = pd.Series([7, -2, 3], index=['a', 'c', 'd'])

In [68]:
s + s3

a    13.0
b     NaN
c     5.0
d     7.0
dtype: float64

### 使用 Fill 方法运算

**还可以使用 Fill 方法****补齐缺失后再****运算：**

In [69]:
s.add(s3, fill_value=0)

a    13.0
b    -5.0
c     5.0
d     7.0
dtype: float64

In [70]:
s.sub(s3, fill_value=2)

a   -1.0
b   -7.0
c    9.0
d    1.0
dtype: float64

In [71]:
s.div(s3, fill_value=4)

a    0.857143
b   -1.250000
c   -3.500000
d    1.333333
dtype: float64

In [72]:
s.mul(s3, fill_value=3)

a    42.0
b   -15.0
c   -14.0
d    12.0
dtype: float64